---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSize.IsValidObject
source: html/7138565e-763e-9c0c-90ea-00f3f79be063.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSize.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.